package controlStatement;

import java.util.Scanner;

public class WhileTask {
	public static void main(String[] args) {
//		MBTI 분석하기
//		사용자가 자신의 MBTI를 입력하면 
//		메세지를 출력해준다.
//		while 문 사용
//      ESFP: 사교적이고 즐거운 분위기를 만들어 사람들을 즐겁게 합니다.
//      INTP: 논리적이고 창의적이며 새로운 아이디어에 열려 있습니다.
//      ISTP: 유연하고 실용적인 사고로 문제 해결 능력이 뛰어납니다.
//      INFJ: 통찰력 있고 깊이 있는 사고로 사람의 마음을 잘 이해합니다.		
		
//      ISTJ: 책임감이 강하고 신뢰할 수 있어 조직의 든든한 기둥입니다.
//      ISFJ: 배려심 깊고 헌신적이며 주변 사람을 따뜻하게 돌봅니다.
//      INFJ: 통찰력 있고 깊이 있는 사고로 사람의 마음을 잘 이해합니다.
//      INTJ: 체계적이고 전략적인 사고로 목표를 효과적으로 달성합니다.
//      ISTP: 유연하고 실용적인 사고로 문제 해결 능력이 뛰어납니다.
//      ISFP: 조용하고 감성적이며 예술적 감각이 뛰어납니다.
//      INFP: 이상을 추구하며 진심으로 타인의 감정을 공감합니다.
//      INTP: 논리적이고 창의적이며 새로운 아이디어에 열려 있습니다.
//      ESTP: 에너지가 넘치고 상황 대처 능력이 뛰어나 행동력이 강합니다.
//      ESFP: 사교적이고 즐거운 분위기를 만들어 사람들을 즐겁게 합니다.
//      ENFP: 열정적이고 창의적이며 사람들과의 교류를 즐깁니다.
//      ENTP: 재치 있고 도전적인 태도로 새로운 것을 시도합니다.
//      ESTJ: 체계적이고 현실적이며 조직을 잘 이끌어갑니다.
//      ESFJ: 사람을 잘 챙기고 조화를 중요시하며 신뢰를 줍니다.
//      ENFJ: 리더십이 뛰어나고 타인을 동기부여하는 능력이 탁월합니다.
//      ENTJ: 결단력 있고 전략적으로 목표를 향해 밀고 나갑니다.		
		
		String mbti = null;
		Scanner sc = new Scanner(System.in);
		
		mbti = sc.next();
		
//		while(true) {
//			if mbti 
//		}
		
	}
}
